&НаКлиенте
Процедура Команда1(Команда)
	Команда1НаСервере();
КонецПроцедуры

&НаСервере
Процедура Команда1НаСервере()
	Перем чКоличествоСтрок, чСтрока, чКолонкаКод, чКолонкаНаименование;
	Перем сКод, сНаименование;
	
	чКолонкаКод = 1;
	чКолонкаНаименование = 2;
	чКоличествоСтрок = ЭтотОбъект.Реквизит_ТабличныйДокумент.ВысотаТаблицы;
	Для чСтрока = 1 По чКоличествоСтрок Цикл
		сКод = ЭтотОбъект.Реквизит_ТабличныйДокумент.Область(чСтрока, чКолонкаКод).Текст;
		сПредставление = ПредставлениеПоКоду(сКод);
		ЭтотОбъект.Реквизит_ТабличныйДокумент.Область(чСтрока, чКолонкаКод + 2).Текст = сПредставление;
		
		сНаименование = ЭтотОбъект.Реквизит_ТабличныйДокумент.Область(чСтрока, чКолонкаНаименование).Текст;
		сПредставление = ПредставлениеПоНаименованию(сНаименование);
		ЭтотОбъект.Реквизит_ТабличныйДокумент.Область(чСтрока, чКолонкаНаименование + 2).Текст = сПредставление;

	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПредставлениеПоКоду(сКод)
	Перем сКодПартнера, сПредставление, сПреффикс, рефПартнер;
	
	сКодПартнера = СокрЛП(сКод);
	сКодПартнера = СтрЗаменить(сКодПартнера, Символы.ВК, "");
	сКодПартнера = СтрЗаменить(сКодПартнера, Символы.ПС, "");
	
	сПредставление = "** НЕ НАЙДЕН **";
	Если ПустаяСтрока(сКодПартнера) Тогда
		Возврат сПредставление;
	КонецЕсли;
	
	сПреффикс = Лев(сКодПартнера, 3);
	Если сПреффикс <> "cr+" Тогда
		сКодПартнера = Лев(сКодПартнера, 2) + "00" + Сред(сКодПартнера, 3, СтрДлина(сКодПартнера) - 2);
	ИначеЕсли сПреффикс = "cr-" И СтрДлина(сКодПартнера) < 11 Тогда
		сКодПартнера = Лев(сКодПартнера, 3) + Прав("0000" + Сред(сКодПартнера, 4, СтрДлина(сКодПартнера) - 3), 8);
	КонецЕсли;
	
	рефПартнер = Справочники.Партнеры.НайтиПоКоду(сКодПартнера, Ложь);
	Если рефПартнер = Неопределено ИЛИ рефПартнер = Справочники.Партнеры.ПустаяСсылка() Тогда
		Возврат сПредставление;
	КонецЕсли;
	
	Если рефПартнер.Родитель <> Справочники.Партнеры.ПустаяСсылка() Тогда
		Возврат "** Подчинен головному контрагенту * " + Строка(рефПартнер.Родитель);
	КонецЕсли;
	
	Возврат Строка(рефПартнер);
КонецФункции

&НаСервере
Функция ПредставлениеПоНаименованию(сНаименование)
	Перем сПредставление, сПреффикс, рефПартнер;
	
	сПредставление = "** НЕ НАЙДЕН **";
	
	рефПартнер = Справочники.Партнеры.НайтиПоНаименованию(сНаименование);
	Если рефПартнер = Неопределено ИЛИ рефПартнер = Справочники.Партнеры.ПустаяСсылка() Тогда
		Возврат сПредставление;
	КонецЕсли;
	
	Если рефПартнер.Родитель <> Справочники.Партнеры.ПустаяСсылка() Тогда
		Возврат "** Подчинен головному контрагенту ** " + Строка(рефПартнер.Родитель);
	КонецЕсли;
	
	Если Истина Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Строка(рефПартнер);
КонецФункции
